module.thelook.google_dataplex_datascan.naveen-scan: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/naveen-scan]
google_storage_bucket.default: Refreshing state... [id=spencer-tf-remote-backend]
module.dataplex_test.google_dataplex_datascan.ui-scan-2: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-2]
module.dataplex_test.google_dataplex_datascan.ui-scan-1: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-1]
module.dataplex_test.google_dataplex_datascan.ui-scan-4: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-4]
module.dataplex_test.google_dataplex_datascan.ui-scan-3: Refreshing state... [id=projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_storage_bucket.default will be destroyed
  # (because google_storage_bucket.default is not in configuration)
  - resource "google_storage_bucket" "default" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "spencer-tf-remote-backend" -> null
      - labels                      = {} -> null
      - location                    = "US" -> null
      - name                        = "spencer-tf-remote-backend" -> null
      - project                     = "ferrous-cipher-432403-j0" -> null
      - project_number              = 44312878874 -> null
      - public_access_prevention    = "enforced" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/spencer-tf-remote-backend" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-03-25T20:29:15.579Z" -> null
      - uniform_bucket_level_access = true -> null
      - updated                     = "2025-03-25T20:29:15.579Z" -> null
      - url                         = "gs://spencer-tf-remote-backend" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-03-25T20:29:15.579Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.dataplex_test.google_dataplex_datascan.sales-scan will be created
  + resource "google_dataplex_datascan" "sales-scan" {
      + create_time      = (known after apply)
      + data_scan_id     = "sales-scan"
      + description      = "Another scan on sales data"
      + display_name     = "sales_scan"
      + effective_labels = (known after apply)
      + execution_status = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = (known after apply)
      + project          = "ferrous-cipher-432403-j0"
      + state            = (known after apply)
      + terraform_labels = (known after apply)
      + type             = (known after apply)
      + uid              = (known after apply)
      + update_time      = (known after apply)

      + data {
          + resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/walmart_sales"
        }

      + data_quality_spec {
          + sampling_percent = 100

          + rules {
              + column      = "Store"
              + description = "Store number should not be negative"
              + dimension   = "ACCURACY"
              + ignore_null = false
              + name        = "store-rule"
              + threshold   = 0

              + sql_assertion {
                  + sql_statement = <<-EOT
                        SELECT Store
                        FROM ${data()}
                          WHERE Store < 0
                    EOT
                }
            }
          + rules {
              + column      = "Holiday_Flag"
              + description = "Checking Holiday Flag"
              + dimension   = "ACCURACY"
              + ignore_null = false
              + name        = "holiday-flag-rule"
              + threshold   = 1

              + row_condition_expectation {
                  + sql_expression = "Holiday_Flag IN (0,1,2)"
                }
            }
        }

      + execution_spec {
          + trigger {
              + on_demand {}
            }
        }
    }

  # module.dataplex_test.google_dataplex_datascan.ui-scan-1 will be destroyed
  # (because google_dataplex_datascan.ui-scan-1 is not in configuration)
  - resource "google_dataplex_datascan" "ui-scan-1" {
      - create_time      = "2025-05-27T20:14:41.597860226Z" -> null
      - data_scan_id     = "ui-scan-1" -> null
      - description      = "The first scan created in the UI (hoorah!) test comment" -> null
      - display_name     = "ui-scan-1" -> null
      - effective_labels = {} -> null
      - execution_status = [
          - {
              - latest_job_end_time   = "2025-05-30T19:02:24.441593074Z"
              - latest_job_start_time = "2025-05-30T19:01:53.714Z"
            },
        ] -> null
      - id               = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-1" -> null
      - labels           = {} -> null
      - location         = "us-central1" -> null
      - name             = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-1" -> null
      - project          = "ferrous-cipher-432403-j0" -> null
      - state            = "ACTIVE" -> null
      - terraform_labels = {} -> null
      - type             = "DATA_QUALITY" -> null
      - uid              = "a7d64a38-0a17-4a0d-861a-2e4176371277" -> null
      - update_time      = "2025-06-02T13:56:06.485413526Z" -> null

      - data {
          - resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/walmart_sales" -> null
        }

      - data_quality_spec {
          - row_filter       = "Date > date('2013-01-01')" -> null
          - sampling_percent = 100 -> null

          - post_scan_actions {
              - bigquery_export {
                  - results_table = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/scan_outputs" -> null
                }
            }

          - rules {
              - column      = "Store" -> null
              - description = "Store nbr should not be negative" -> null
              - dimension   = "ACCURACY" -> null
              - ignore_null = false -> null
              - name        = "rule-1-store" -> null
              - threshold   = 0 -> null

              - sql_assertion {
                  - sql_statement = <<-EOT
                        SELECT Store
                        FROM ${data()}
                          WHERE Store < 0
                    EOT -> null
                }
            }
          - rules {
              - column      = "Unemployment" -> null
              - description = "Unemployment should not be higher than 20" -> null
              - dimension   = "ACCURACY" -> null
              - ignore_null = false -> null
              - name        = "rule-2-unemployment-value" -> null
              - threshold   = 0 -> null

              - sql_assertion {
                  - sql_statement = <<-EOT
                        SELECT Unemployment
                        FROM ${data()}
                          WHERE Unemployment > 10
                    EOT -> null
                }
            }
          - rules {
              - column      = "Holiday_Flag" -> null
              - description = "Row Check rule: holiday_flag should only be 0,1,2" -> null
              - dimension   = "ACCURACY" -> null
              - ignore_null = false -> null
              - name        = "rule-3-holiday-flag" -> null
              - threshold   = 1 -> null

              - row_condition_expectation {
                  - sql_expression = "Holiday_Flag IN (0,1,2)" -> null
                }
            }
          - rules {
              - description = "Henry just loves this rule" -> null
              - dimension   = "FRESHNESS" -> null
              - ignore_null = false -> null
              - name        = "henrys-favorite" -> null
              - threshold   = 0 -> null

              - sql_assertion {
                  - sql_statement = <<-EOT
                        SELECT count(*) as ct 
                        FROM ${data()}
                        HAVING ct = 0
                    EOT -> null
                }
            }
        }

      - execution_spec {
          - trigger {
              - on_demand {}
            }
        }
    }

  # module.dataplex_test.google_dataplex_datascan.ui-scan-2 will be destroyed
  # (because google_dataplex_datascan.ui-scan-2 is not in configuration)
  - resource "google_dataplex_datascan" "ui-scan-2" {
      - create_time      = "2025-05-27T19:19:42.941168172Z" -> null
      - data_scan_id     = "ui-scan-2" -> null
      - description      = "This is the second scan created in UI" -> null
      - display_name     = "ui-scan-2" -> null
      - effective_labels = {} -> null
      - execution_status = [] -> null
      - id               = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-2" -> null
      - labels           = {} -> null
      - location         = "us-central1" -> null
      - name             = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-2" -> null
      - project          = "ferrous-cipher-432403-j0" -> null
      - state            = "ACTIVE" -> null
      - terraform_labels = {} -> null
      - type             = "DATA_QUALITY" -> null
      - uid              = "84731e67-2faa-474b-8dc5-128b6a54d5ba" -> null
      - update_time      = "2025-05-27T19:19:48.047820947Z" -> null

      - data {
          - resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/walmart_sales" -> null
        }

      - data_quality_spec {
          - sampling_percent = 100 -> null

          - post_scan_actions {
              - bigquery_export {
                  - results_table = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/scan_outputs" -> null
                }
            }

          - rules {
              - column      = "Temperature" -> null
              - description = "Temperature should not be below -40" -> null
              - dimension   = "ACCURACY" -> null
              - ignore_null = false -> null
              - name        = "ui-scan-2-rule-1-temperature" -> null
              - threshold   = 0 -> null

              - sql_assertion {
                  - sql_statement = <<-EOT
                        SELECT Temperature
                        FROM ferrous-cipher-432403-j0.dataplex_test.walmart_sales
                        WHERE Temperature < -40
                    EOT -> null
                }
            }
        }

      - execution_spec {
          - trigger {
              - on_demand {}
            }
        }
    }

  # module.dataplex_test.google_dataplex_datascan.ui-scan-3 will be destroyed
  # (because google_dataplex_datascan.ui-scan-3 is not in configuration)
  - resource "google_dataplex_datascan" "ui-scan-3" {
      - create_time      = "2025-05-26T16:50:55.716644110Z" -> null
      - data_scan_id     = "ui-scan-3" -> null
      - description      = "This is a test to see if we can import this to terraform" -> null
      - display_name     = "ui-scan-3" -> null
      - effective_labels = {} -> null
      - execution_status = [] -> null
      - id               = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-3" -> null
      - labels           = {} -> null
      - location         = "us-central1" -> null
      - name             = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-3" -> null
      - project          = "ferrous-cipher-432403-j0" -> null
      - state            = "ACTIVE" -> null
      - terraform_labels = {} -> null
      - type             = "DATA_QUALITY" -> null
      - uid              = "ba823439-ab2e-475b-9a83-08941b460385" -> null
      - update_time      = "2025-05-26T16:51:00.550917337Z" -> null

      - data {
          - resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/walmart_sales" -> null
        }

      - data_quality_spec {
          - row_filter       = "Weekly_Sales > 1500000" -> null
          - sampling_percent = 100 -> null

          - rules {
              - column      = "Temperature" -> null
              - description = "Foo" -> null
              - dimension   = "ACCURACY" -> null
              - ignore_null = false -> null
              - name        = "test-rule-3" -> null
              - threshold   = 0 -> null

              - sql_assertion {
                  - sql_statement = <<-EOT
                        SELECT count(*) as ct
                        FROM ferrous-cipher-432403-j0.dataplex_test.walmart_sales
                        WHERE temperature > 30
                        HAVING ct > 0
                    EOT -> null
                }
            }
        }

      - execution_spec {
          - trigger {
              - on_demand {}
            }
        }
    }

  # module.dataplex_test.google_dataplex_datascan.ui-scan-4 will be destroyed
  # (because google_dataplex_datascan.ui-scan-4 is not in configuration)
  - resource "google_dataplex_datascan" "ui-scan-4" {
      - create_time      = "2025-05-27T19:30:33.160893697Z" -> null
      - data_scan_id     = "ui-scan-4" -> null
      - description      = "Made this in UI" -> null
      - display_name     = "ui-scan-4" -> null
      - effective_labels = {} -> null
      - execution_status = [
          - {
              - latest_job_end_time   = "2025-05-27T19:31:44.617710359Z"
              - latest_job_start_time = "2025-05-27T19:31:16.369Z"
            },
        ] -> null
      - id               = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-4" -> null
      - labels           = {} -> null
      - location         = "us-central1" -> null
      - name             = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/ui-scan-4" -> null
      - project          = "ferrous-cipher-432403-j0" -> null
      - state            = "ACTIVE" -> null
      - terraform_labels = {} -> null
      - type             = "DATA_QUALITY" -> null
      - uid              = "8bc0031c-deb0-4594-871c-3d7a61cebc94" -> null
      - update_time      = "2025-05-28T22:01:16.356124338Z" -> null

      - data {
          - resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/dataplex_test/tables/walmart_sales" -> null
        }

      - data_quality_spec {
          - sampling_percent = 90 -> null

          - rules {
              - column      = "Temperature" -> null
              - dimension   = "VALIDITY" -> null
              - ignore_null = false -> null
              - threshold   = 1 -> null

              - non_null_expectation {}
            }
        }

      - execution_spec {
          - trigger {
              - on_demand {}
            }
        }
    }

  # module.flowers.google_dataplex_datascan.iris-scan will be created
  + resource "google_dataplex_datascan" "iris-scan" {
      + create_time      = (known after apply)
      + data_scan_id     = "iris-scan"
      + description      = "This is a scan on iris created originally in dev (My Project Prod)"
      + display_name     = "iris_scan"
      + effective_labels = (known after apply)
      + execution_status = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = (known after apply)
      + project          = "ferrous-cipher-432403-j0"
      + state            = (known after apply)
      + terraform_labels = (known after apply)
      + type             = (known after apply)
      + uid              = (known after apply)
      + update_time      = (known after apply)

      + data {
          + resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/flowers/tables/iris"
        }

      + data_quality_spec {
          + row_filter       = "sepal_length > 1.0"
          + sampling_percent = 100

          + rules {
              + description = "Check for freshness on iris"
              + dimension   = "FRESHNESS"
              + ignore_null = false
              + name        = "fresh-flowers"
              + threshold   = 0

              + sql_assertion {
                  + sql_statement = <<-EOT
                        SELECT count(*) as ct
                        FROM ${data()}
                          HAVING ct = 0
                    EOT
                }
            }
        }

      + execution_spec {
          + trigger {
              + on_demand {}
            }
        }
    }

  # module.thelook.google_dataplex_datascan.naveen-scan will be destroyed
  # (because google_dataplex_datascan.naveen-scan is not in configuration)
  - resource "google_dataplex_datascan" "naveen-scan" {
      - create_time      = "2025-06-02T13:55:19.847787556Z" -> null
      - data_scan_id     = "naveen-scan" -> null
      - display_name     = "naveen_scan" -> null
      - effective_labels = {} -> null
      - execution_status = [
          - {
              - latest_job_end_time   = "2025-06-02T13:56:28.262362790Z"
              - latest_job_start_time = "2025-06-02T13:55:59.752Z"
            },
        ] -> null
      - id               = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/naveen-scan" -> null
      - labels           = {} -> null
      - location         = "us-central1" -> null
      - name             = "projects/ferrous-cipher-432403-j0/locations/us-central1/dataScans/naveen-scan" -> null
      - project          = "ferrous-cipher-432403-j0" -> null
      - state            = "ACTIVE" -> null
      - terraform_labels = {} -> null
      - type             = "DATA_QUALITY" -> null
      - uid              = "a37d1078-15fd-4078-aba7-96fdd0e2e63e" -> null
      - update_time      = "2025-06-02T13:55:24.833060337Z" -> null

      - data {
          - resource = "//bigquery.googleapis.com/projects/ferrous-cipher-432403-j0/datasets/thelook/tables/order_items" -> null
        }

      - data_quality_spec {
          - sampling_percent = 100 -> null

          - rules {
              - description = "bar" -> null
              - dimension   = "FRESHNESS" -> null
              - ignore_null = false -> null
              - name        = "foo" -> null
              - threshold   = 0 -> null

              - sql_assertion {
                  - sql_statement = <<-EOT
                        SELECT count(*) as ct 
                        FROM ${data()}
                        HAVING ct = 0
                    EOT -> null
                }
            }
        }

      - execution_spec {
          - trigger {
              - on_demand {}
            }
        }
    }

Plan: 2 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
